#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KrisCo/Lab-development/runs/run-WpTpPKT4H52wewXN

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_vpc.lab: Refreshing state... [id=vpc-02ce1c6fed2e29014]
aws_internet_gateway.lab: Refreshing state... [id=igw-03dea3b2842675aeb]
aws_subnet.lab-public: Refreshing state... [id=subnet-05e57c01cd781d51b]
aws_security_group.webserver-SG: Refreshing state... [id=sg-0cd8ffb7100546167]
aws_route_table.lab: Refreshing state... [id=rtb-01a9cb996c18d8ae5]
aws_instance.EC2: Refreshing state... [id=i-067b728effc6a87e7]
aws_route_table_association.public-access: Refreshing state... [id=rtbassoc-067c56483b70575a5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.EC2 must be replaced
-/+ resource "aws_instance" "EC2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-067b728effc6a87e7" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-067b728effc6a87e7" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-08d8f0127aa311ddf" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-147.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.147" -> (known after apply)
      ~ public_dns                           = "ec2-44-201-251-244.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "44.201.251.244" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0cd8ffb7100546167",
        ]
        tags                                 = {
            "Name" = "EC2-development"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "bbeaa1ace870e5d2ae72c9a37341848aba462f82" -> "8903d2b8aee2f4435ce86d2c1c092d3e09ce15f0"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0cd8ffb7100546167",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-04ca4d4032a18f481" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ web-address = "ec2-44-201-251-244.compute-1.amazonaws.com" -> (known after apply)

```

</details>

*Pushed by: @krispigeau, Action: `pull_request`*